<a href="https://colab.research.google.com/github/arwahh/Python-_libraries/blob/main/pnadas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#adding columns
import pandas as pd
data={
    "Name":["arwah","seher","falak","simran","arooj","khusbhoo"],
    "Age":[22,25,28,23,23,22],
    "Salary":[80000,50000,90000,45000,50000,60000],
    "Performance_score":[90,95,80,50,88,80]
}
df=pd.DataFrame(data)
print(df)
df["bonus"]=df["Salary"]*0.1
print(df)

       Name  Age  Salary  Performance_score
0     arwah   22   80000                 90
1     seher   25   50000                 95
2     falak   28   90000                 80
3    simran   23   45000                 50
4     arooj   23   50000                 88
5  khusbhoo   22   60000                 80
       Name  Age  Salary  Performance_score   bonus
0     arwah   22   80000                 90  8000.0
1     seher   25   50000                 95  5000.0
2     falak   28   90000                 80  9000.0
3    simran   23   45000                 50  4500.0
4     arooj   23   50000                 88  5000.0
5  khusbhoo   22   60000                 80  6000.0

In [ ]:
# using insert values
import pandas as pd
data={
    "Name":["arwah","seher","falak","simran","arooj","khusbhoo"],
    "Age":[22,25,28,23,23,22],
    "Salary":[80000,50000,90000,45000,50000,60000],
    "Performance_score":[90,95,80,50,88,80]
}
df=pd.DataFrame(data)
print(df)
df.insert(0,"employee ID",[10,20,30,40,50,60])
print(df)

       Name  Age  Salary  Performance_score
0     arwah   22   80000                 90
1     seher   25   50000                 95
2     falak   28   90000                 80
3    simran   23   45000                 50
4     arooj   23   50000                 88
5  khusbhoo   22   60000                 80
   employee ID      Name  Age  Salary  Performance_score
0           10     arwah   22   80000                 90
1           20     seher   25   50000                 95
2           30     falak   28   90000                 80
3           40    simran   23   45000                 50
4           50     arooj   23   50000                 88
5           60  khusbhoo   22   60000                 80

In [ ]:
#updating values
import pandas as pd
data={
    "Name":["arwah","seher","falak","simran","arooj","khusbhoo"],
    "Age":[22,25,28,23,23,22],
    "Salary":[80000,50000,90000,45000,50000,60000],
    "Performance_score":[90,95,80,50,88,80]
}
df=pd.DataFrame(data)
print(df)
df.loc[0,"salary"]=55000
print(df)

       Name  Age  Salary  Performance_score
0     arwah   22   80000                 90
1     seher   25   50000                 95
2     falak   28   90000                 80
3    simran   23   45000                 50
4     arooj   23   50000                 88
5  khusbhoo   22   60000                 80
       Name  Age  Salary  Performance_score   salary
0     arwah   22   80000                 90  55000.0
1     seher   25   50000                 95      NaN
2     falak   28   90000                 80      NaN
3    simran   23   45000                 50      NaN
4     arooj   23   50000                 88      NaN
5  khusbhoo   22   60000                 80      NaN

In [ ]:
import pandas as pd
data={
    "Name":["arwah","seher","falak","simran","arooj","khusbhoo"],
    "Age":[22,25,28,23,23,22],
    "Salary":[80000,50000,90000,45000,50000,60000],
    "Performance_score":[90,95,80,50,88,80]
}
df=pd.DataFrame(data)
print(df)
df["Salary"]=df["Salary"]*1.05
print(df)

       Name  Age  Salary  Performance_score
0     arwah   22   80000                 90
1     seher   25   50000                 95
2     falak   28   90000                 80
3    simran   23   45000                 50
4     arooj   23   50000                 88
5  khusbhoo   22   60000                 80
       Name  Age   Salary  Performance_score
0     arwah   22  84000.0                 90
1     seher   25  52500.0                 95
2     falak   28  94500.0                 80
3    simran   23  47250.0                 50
4     arooj   23  52500.0                 88
5  khusbhoo   22  63000.0                 80

In [3]:
import pandas as pd
data={
    "Name":["arwah","seher","falak","simran","arooj","khusbhoo"],
    "Age":[22,25,28,23,23,22],
    "Salary":[80000,50000,90000,45000,50000,60000],
    "Performance_score":[90,95,80,50,88,80]
}
df=pd.DataFrame(data)
print(df)
df.drop(columns=["Age"],inplace=True)
print(df)

       Name  Age  Salary  Performance_score
0     arwah   22   80000                 90
1     seher   25   50000                 95
2     falak   28   90000                 80
3    simran   23   45000                 50
4     arooj   23   50000                 88
5  khusbhoo   22   60000                 80
       Name  Salary  Performance_score
0     arwah   80000                 90
1     seher   50000                 95
2     falak   90000                 80
3    simran   45000                 50
4     arooj   50000                 88
5  khusbhoo   60000                 80

In [4]:
import pandas as pd
data={
    "Name":["arwah","seher","falak","simran","arooj","khusbhoo"],
    "Age":[22,25,28,23,23,22],
    "Salary":[80000,50000,90000,45000,50000,60000],
    "Performance_score":[90,95,80,50,88,80]
}
df=pd.DataFrame(data)
print(df)
df.drop(columns=["Performance_score","Age"],inplace=True)
print(df)

       Name  Age  Salary  Performance_score
0     arwah   22   80000                 90
1     seher   25   50000                 95
2     falak   28   90000                 80
3    simran   23   45000                 50
4     arooj   23   50000                 88
5  khusbhoo   22   60000                 80
       Name  Salary
0     arwah   80000
1     seher   50000
2     falak   90000
3    simran   45000
4     arooj   50000
5  khusbhoo   60000